# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for one_name in names:
    print(one_name)

print()  #Разделение вывода между задачами


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
for one_name in names:
    print(one_name, len(one_name))

print()  #Разделение вывода между задачами

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
for gen_name in is_male:
    if is_male[gen_name] == False:
        print(f"{gen_name} - Это женский пол")
    else:
        print(f"{gen_name} - Это мужской пол") 


print()  #Разделение вывода между задачами



# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]

print("Количество групп:",len(groups))
count=0
for quantity_students in groups:
    count+=1
    print(f'Группа {count}: {len(quantity_students)} учащихся')



print()  #Разделение вывода между задачами

# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
count=0
for name_students in groups:
    count+=1
    print(f'Группа {count}: {name_students}')

